snlkuharlocal/src/DataProcessors/КурсыВалютРБК/КурсыВалютРБК.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>КурсыВалютРБК</name>
  <comment>Загрузка курсов валют с сайта РБК</comment>
  <attributes>
    <name>НачДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонДата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокВалют</name>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

snlkuharlocal/src/InformationRegisters/КурсыВалют/КурсыВалют.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КурсыВалют</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Курс</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>5</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Кратность</name>
    <comment>(Общ)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Валюта</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

snlkuharlocal/src/DataProcessors/КурсыВалютРБК/ObjectModule.bsl
Перем ИмяФайла;

// Выделяет из переданной строки первое значение
//  до символа "TAB"
//
// Параметры: 
//  ИсходнаяСтрока - Строка - строка для разбора
//
// Возвращаемое значение:
//  подстроку до символа "TAB"
//
Функция ВыделитьПодСтроку(ИсходнаяСтрока)
	
	Перем ПодСтрока;
	
	Поз = Найти(ИсходнаяСтрока,Символы.Таб);
	Если Поз > 0 Тогда
		ПодСтрока = Лев(ИсходнаяСтрока,Поз-1);
		ИсходнаяСтрока = Сред(ИсходнаяСтрока,Поз+1);
	Иначе
		ПодСтрока = ИсходнаяСтрока;
		ИсходнаяСтрока = "";
	КонецЕсли;
	
	Возврат ПодСтрока;
	
КонецФункции // ВыделитьПодСтроку()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТИРУЕМЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Производит загрузку курсов и кратностей валют с сайта РБК
//
// Параметры:
//  ИндикаторФормы     - ЭлементыФормы типа Индикатор - для отработки индикатора формы
//  НадписьВалютыФормы - ЭлементыФормы типа Надпись  - Для отработки надписи 
//													   загружаемой валюты
//
Процедура ЗагрузитьКурсыСРБК(ИндикаторФормы = Неопределено,НадписьВалютыФормы = Неопределено) Экспорт
	
	Перем HTTP;
	
	ОтрабатыватьИндикатор = Ложь;
	ОтрабатыватьНадпись   = Ложь;
	Если ИндикаторФормы <> Неопределено Тогда
		ОтрабатыватьИндикатор = Истина;
	КонецЕсли;	
	Если НадписьВалютыФормы <> Неопределено Тогда
		ОтрабатыватьНадпись = Истина;
	КонецЕсли;	
	
	РегистрКурсыВалют = РегистрыСведений.КурсыВалют;
	ЗаписьКурсовВалют = РегистрКурсыВалют.СоздатьМенеджерЗаписи();
	
	Текст = Новый ТекстовыйДокумент();
	
	СерверИсточник = "cbrates.rbc.ru";
	ОбработкаПолученияФайлов = Обработки.ПолучениеФайловИзИнтернета.Создать();
	
	Адрес1 = "tsv/cb/";  // в интервале
	Адрес2 = "tsv/";     // по 1 дате
	Если НачДата = КонДата Тогда  // по 1 дате
		Адрес = Адрес2;
		ТМП   = "/"+Формат(Год(КонДата),"ЧРГ=; ЧГ=0")+"/"+Формат(Месяц(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=")+"/"+Формат(День(КонДата),"ЧЦ=2;ЧДЦ=0;ЧВН=");
	Иначе    // в интервале
		Адрес = Адрес1;
		ТМП   = "";
	КонецЕсли;
	
	ВремКаталог = КаталогВременныхФайлов() + "tempKurs";
	СоздатьКаталог(ВремКаталог);
	УдалитьФайлы(ВремКаталог,"*.*");
	
	Для каждого СтрокаСпВалют из СписокВалют Цикл
		
		ТекВалюта = СтрокаСпВалют.Валюта;
		Стр = "";
		ИмяВходящегоФайла = "" + ВремКаталог + "\" + ИмяФайла;
		СтрокаПараметраПолучения = Адрес + Прав(ТекВалюта.Код,3) + ТМП + ".tsv";
		Если ОбработкаПолученияФайлов.ЗапроситьФайлыССервера(СерверИсточник, СтрокаПараметраПолучения, ИмяВходящегоФайла, HTTP) <> Истина Тогда
			//ЗаписатьВЛог(ИмяЛога,Сообщение,ТипСообщения,ВыводитьСообщения=Ложь) Экспорт
			ЗаписатьВЛог("ЗагрузкаКурсов","Не удалось получить ресурс для валюты " + СокрЛП(ТекВалюта.Наименование) + " (код " + ТекВалюта.Код + "). Курс для валюты не загружен.","Ошибка",Истина); 
			Продолжить;
		КонецЕсли; 
		
		ВходящийФайл = Новый Файл(ИмяВходящегоФайла);
		Если НЕ ВходящийФайл.Существует() Тогда
			Сообщить("Не удалось получить ресурс для валюты " + СокрЛП(ТекВалюта.Наименование) + " (код " + ТекВалюта.Код + "). Курс для валюты не загружен."); 
			Продолжить;
		КонецЕсли;	
		
		Текст.Прочитать(ИмяВходящегоФайла,КодировкаТекста.ANSI);
		
		КолСтрок = Текст.КоличествоСтрок();
		Для Инд = 1 По КолСтрок Цикл
			Если ОтрабатыватьНадпись Тогда
				НадписьВалютыФормы.Заголовок = "" + СокрЛП(ТекВалюта.Наименование);
			КонецЕсли;	
			
			Если ОтрабатыватьИндикатор Тогда
				ИндикаторФормы.Значение = Инд/КолСтрок * 100;
			КонецЕсли;	
			
			Стр = Текст.ПолучитьСтроку(Инд);
			Если (Стр = "") ИЛИ (Найти(Стр,Символы.Таб) = 0) Тогда
				Продолжить;
			КонецЕсли;
			Если НачДата = КонДата Тогда  
				ДатаКурса = КонДата;
			Иначе 
				ДатаКурсаСтр = ВыделитьПодСтроку(Стр);
				ДатаКурса    = Дата(Лев(ДатаКурсаСтр,4),Сред(ДатаКурсаСтр,5,2),Сред(ДатаКурсаСтр,7,2));
			КонецЕсли;
			Кратность = Число(ВыделитьПодСтроку(Стр));
			Курс      = Число(ВыделитьПодСтроку(Стр));
			
			Если ДатаКурса > КонДата Тогда
				Прервать;
			КонецЕсли;
			
			Если ДатаКурса < НачДата Тогда 
				Продолжить;
			КонецЕсли;
			
			// Кухарь А.Ю.  15.06.2022 начало
			// Изменили точность курса до 5
			//крохин начало 10.06.2022
			//для юаня кратность всегда 1, жертвуем точностью ради того, чтобы не менять постоянно кратность
			Если ТекВалюта = Справочники.Валюты.НайтиПоКоду("156") Тогда
				//Курс = Окр(Курс/Кратность,4);
				Курс = Окр(Курс/Кратность,5);
				Кратность = 1;
			КонецЕсли;		 
			// Кухарь А.Ю.  15.06.2022 конец
			
			
			ЗаписьКурсовВалют.Валюта = ТекВалюта;
			ЗаписьКурсовВалют.Период = ДатаКурса;
			ЗаписьКурсовВалют.Прочитать();
			ЗаписьКурсовВалют.Валюта    = ТекВалюта;
			ЗаписьКурсовВалют.Период    = ДатаКурса;
			ЗаписьКурсовВалют.Курс      = Курс;
			ЗаписьКурсовВалют.Кратность = Кратность;
			
			ЗаписьКурсовВалют.Записать();
		КонецЦикла;	   
	КонецЦикла;	
	УдалитьФайлы(ВремКаталог,"*.*");
	
	
	//Кухарь 25.02.16 начало
	//Проверка что загрузился курс за период
	запрос=новый запрос;
	запрос.Текст="ВЫБРАТЬ
	|	КурсыВалют.Период,
	|	КурсыВалют.Валюта,
	|	КурсыВалют.Курс,
	|	КурсыВалют.Кратность
	|ИЗ
	|	РегистрСведений.КурсыВалют КАК КурсыВалют
	|ГДЕ
	|	КурсыВалют.Период МЕЖДУ &Дата1 И &Дата2";
	запрос.УстановитьПараметр("Дата1",НачалоДня(ТекущаяДата()));
	запрос.УстановитьПараметр("Дата2",КонецДня(ТекущаяДата()));
	КолЗаписей=запрос.Выполнить().Выгрузить().Количество();
	если КолЗаписей =0 тогда
		
		
		Профиль= Новый ИнтернетПочтовыйПрофиль;
		// Кухарь А.Ю.  08.09.2022 начало
		//Профиль.АдресСервераPOP3   = "srvmail2.collant.ru";
		//Профиль.АдресСервераSMTP   =  "srvmail2.collant.ru";
		//Профиль.ПортPOP3           = 110; 
		ПараметрыПочты = ОбщегоНазначения_ПИ.ПолучитьДанныеПочтовогоСервера();
		ЗаполнитьЗначенияСвойств(Профиль,ПараметрыПочты);	
		// Кухарь А.Ю.  08.09.2022 конец
		Профиль.ВремяОжидания      = 60; 
		// Ихсанов Д. А. Начало 14.10.2025 https://yougile.collant.ru/team/ab6bad3a05c0/#ASU-2548
		//Профиль.Пользователь="*%*%*%";
		//Профиль.Пароль="*$*$*$";
		Профиль.Пользователь = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Логин;
		Профиль.Пароль = РаботаСБезопаснымХранилищемПовтИсп.ПрочитатьДанныеАвторизацииПоКлючу(
			Справочники.КлючиБезопасногоХранилищаДанных.ДанныеАвторизацииКПочтовомуСерверуХелпДеск).Пароль;
		// Ихсанов Д. А. Конец  14.10.2025
		Сообщение=новый интернетПочтовоеСообщение;
		Сообщение.Получатели.Добавить("krohin@collant.ru");
		Сообщение.Получатели.Добавить("kuhar@collant.ru");
		//Сообщение.Получатели.Добавить("nikolaev@collant.ru");
		// +++ {Кузнецов Сергей Владимирович [11.04.2025] HELP-2668
		//Феданченков М.С. 10.06.2026 начало
		//наряд 0000001265
		Сообщение.Получатели.Добавить("tp@collant.ru");
		//Феданченков М.С. 10.06.2026 конец
		
		// }Кузнецов Сергей Владимирович +++ [11.04.2025]
		
		Сообщение.Тема="Загрузка валют";
		Сообщение.Отправитель = "helpdesk@collant.ru";
		// +++ {Кузнецов Сергей Владимирович [11.04.2025] HELP-2668
		//Сообщение.Тексты.Добавить("Не загрузились курсы валют за "+Лев(Строка(ТекущаяДата()),10));
		Сообщение.Тексты.Добавить("Не загрузились курсы валют за "+Лев(Строка(ТекущаяДата()),10) + " Необходимо загрузить курсы вручную");
		// }Кузнецов Сергей Владимирович +++ [11.04.2025]
		Почта= Новый ИнтернетПочта;
		попытка
			Почта.Подключиться(Профиль);
		исключение	
		конецПопытки;
		Попытка
			Почта.Послать(Сообщение);
		исключение
		конецПопытки;
		Почта.Отключиться();
	КонецЕсли;
	
	
	
	//Кухарь 25.02.16 конец
	
	
КонецПроцедуры // ЗагрузитьКурсыСРБК()

////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ

ИмяФайла = "Curses.txt";
